src/test/resources/org/lockss/ws/hasher/removeAsynchronousHashRequestRequest.xml

<!--
Sample SOAP request for simple testing.

Usage:
  curl -H "content-type: text/xml" -d @path/to/this/file
       http://user:pass@host:port/ws/HasherService
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:service="http://hasher.ws.lockss.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <service:removeAsynchronousHashRequest>
          <requestId>upBQM</requestId>
        </service:removeAsynchronousHashRequest>
    </soapenv:Body>
</soapenv:Envelope>
